# Message Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialogShowingEventArgs..::..Message Property
TaskDialogShowingEventArgs Class See Also
---
The message that has been displayed in the dialog box.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public string Message { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Message As String
	Get
```

Visual C++
---
```text
public:
property String^ Message {
	String^ get ();
}
```

# See Also
TaskDialogShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace